{
	"tokensData": [
		{
			"id": "eth",
			"name": "Ethereum",
			"about": "Ethereum is a smart contract platform that enables developers to freely build decentralized applications. Ether (ETH) is Ethereum’s native token that is used to pay transaction fees to miners. In specific situations, for ETH to be exchanged with other Ethereum-based tokens, it needs to be wrapped into WETH. Wrapping ETH does not affect its value, 1 ETH = 1 WETH.",
			"circulatingSupply": "120,459,823 ETH",
			"marketCap": "$182.44B USD",
			"allTimeRoi": "9647.7 %",
			"marketCapRank": "#2",
			"volume24High": "$11.11B USD",
			"volume24Low": "$1446.97",
			"high24Hour": "$1529.56",
			"currentPrice": "$1587.93",
			"imageUrl": "./assets/eth.webp"
		},
		{
			"id": "dai",
			"name": "Dai",
			"about": "DAI is a decentralized stablecoin created by MakerDAO. 1 DAI = 1 US Dollar and will remain so until the token is taken out of circulation. DAI is generated by depositing ETH and other tokens into a MakerDAO collateralized debt position",
			"circulatingSupply": "6,241,292,841 DAI",
			"marketCap": "$6.03B USD",
			"allTimeRoi": "-",
			"marketCapRank": "#15",
			"volume24High": "$1.29B USD",
			"volume24Low": "$0.941944",
			"high24Hour": "$0.984121",
			"currentPrice": "$1.00"
		},
		{
			"id": "crv",
			"name": "Curve",
			"about": "CRV is the native governance token of Curve, an automated market maker protocol for trading highly correlated token pairs (e.g. USDC for USDT, wBTC for renBTC). CRV gives token holders several functions including time-weighted voting rights in the Curve DAO and eligibility to accrue liquidity rewards.",
			"circulatingSupply": "768,122,203 CRV",
			"marketCap": "$688.53M USD",
			"allTimeRoi": "-",
			"marketCapRank": "#61",
			"volume24High": "$74.06M USD",
			"volume24Low": "$0.80823",
			"high24Hour": "$0.896391",
			"currentPrice": "$0.92"
		},
		{
			"id": "mana",
			"name": "Decentraland",
			"about": "MANA is a native token of Decentraland, a virtual reality platform powered by Ethereum that allows users to create, experience, and monetize content and applications. In Decentraland, users purchase plots of land that they can later navigate, build upon, and monetize. Decentraland uses two tokens: MANA and LAND. MANA is used and burned to acquire LAND within the virtual world.",
			"circulatingSupply": "1,822,405,168 MANA",
			"marketCap": "$979.3M USD",
			"allTimeRoi": "2571.8 %",
			"marketCapRank": "#48",
			"volume24High": "$59.15M USD",
			"volume24Low": "$0.507562",
			"high24Hour": "$0.537373",
			"currentPrice": "$0.55"
		},
		{
			"id": "ren",
			"name": "Ren",
			"about": "REN is used as a staking token within Ren Protocol to validate transactions on the network. Ren enables users to transfer assets between any two blockchains, while maintaining complete privacy.",
			"circulatingSupply": "1,000,000,000 REN",
			"marketCap": "$80M USD",
			"allTimeRoi": "-10.2 %",
			"marketCapRank": "#307",
			"volume24High": "$13.22M USD",
			"volume24Low": "$0.074982",
			"high24Hour": "$0.079916",
			"currentPrice": "$0.08"
		},
		{
			"id": "sand",
			"name": "Sandbox",
			"about": "The Sandbox is a community-driven platform where creators can monetize voxel ASSETS and gaming experiences on the blockchain. SAND is the utility token used throughout The Sandbox ecosystem as the basis of transactions and interactions. It is an ERC-20 utility token built on the Ethereum blockchain. There is a finite supply of 3,000,000,000 SAND.",
			"circulatingSupply": "1,811,481,926 SAND",
			"marketCap": "$975.7M USD",
			"allTimeRoi": "-",
			"marketCapRank": "#49",
			"volume24High": "$97M USD",
			"volume24Low": "$0.515389",
			"high24Hour": "$0.538622",
			"currentPrice": "$0.55"
		},
		{
			"id": "swrv",
			"name": "Swerve",
			"about": "SWRV is the native token for Swerve Finance, a community fork of curve.fi, whose aim is to deliver efficient stable coin to stable coin trading at scale through an automated market maker protocol. The main difference between Swerve and Curve is the removal of both developer and platform fees. SWRV enables holders to both participate in governance over the protocol along with earning liquidity incentives.",
			"circulatingSupply": "18,314,527 SWRV",
			"marketCap": "$2.07M USD",
			"allTimeRoi": "-",
			"marketCapRank": "#1634",
			"volume24High": "$227.88K USD",
			"volume24Low": "$0.105175",
			"high24Hour": "$0.114715",
			"currentPrice": "$0.12"
		},
		{
			"id": "uni",
			"name": "Uniswap",
			"about": "UNI is the governance token of Uniswap, a decentralized exchange protocol characterized by its automated market maker (AMM) functionality. The UNI token enables token holders to share in ownership over the governance system of the protocol.",
			"circulatingSupply": "753,766,667 UNI",
			"marketCap": "$4.24B USD",
			"allTimeRoi": "-",
			"marketCapRank": "#19",
			"volume24High": "$80.1M USD",
			"volume24Low": "$5.38",
			"high24Hour": "$5.65",
			"currentPrice": "$5.83"
		},
		{
			"id": "usdc",
			"name": "USD Coin",
			"about": "USD Coin (USDC) is a centralized stablecoin created jointly by Circle and Coinbase. 1 USDC is redeemable for 1 US Dollar on Coinbase, thus maintaining its 1:1 peg.",
			"circulatingSupply": "40,642,552,624 USDC",
			"marketCap": "$39.11B USD",
			"allTimeRoi": "-",
			"marketCapRank": "#5",
			"volume24High": "$8.8B USD",
			"volume24Low": "$0.937664",
			"high24Hour": "$0.97547",
			"currentPrice": "$1.00"
		},
		{
			"id": "usdt",
			"name": "Tether (USDT)",
			"about": "Tether (USDT) is a centralized stablecoin that maintains a 1:1 peg with the US Dollar. 1 USDT = 1 USD",
			"circulatingSupply": "72,116,708,664 USDT",
			"marketCap": "$72.75B USD",
			"allTimeRoi": "-",
			"marketCapRank": "#3",
			"volume24High": "$40.64B USD",
			"volume24Low": "$0.999112",
			"high24Hour": "$1.016",
			"currentPrice": "$1.04"
		},
		{
			"id": "wbtc",
			"name": "Wrapped Bitcoin",
			"about": "Wrapped Bitcoin (WBTC) is a token that is generated by fully-collateralizing BTC with a custodian and minting a Ethereum-compatible token that can be exchanged with other tokens.",
			"circulatingSupply": "153,164 WBTC",
			"marketCap": "$3.21B USD",
			"allTimeRoi": "-",
			"marketCapRank": "#23",
			"volume24High": "$303.16M USD",
			"volume24Low": "$20239",
			"high24Hour": "$21048",
			"currentPrice": "$21912.70"
		},
		{
			"id": "mask",
			"name": "Mask Network",
			"about": "Mask Network is the core product of Dimension, which is positioned to become the bridge that connects internet users from Web 2.0 to Web 3.0. The foundational technology of Mask Network is a peer-to-peer encrypted messaging application, with new functions continuously being created around this foundation. We at Mask Network are strong believers in the ownership economy. People should own what they produce, people should own their data, their attention and the virtual space they choose to contribute to. Mask Network integrates decentralized social messaging, borderless payment network, and decentralized file storage and sharing to provide a safe and convenient portal for users to jump right into the continent of decentralized finance and then the new world of Web 3.0.",
			"circulatingSupply": "76,150,000 MASK",
			"marketCap": "$221.58M USD",
			"allTimeRoi": "-",
			"marketCapRank": "#163",
			"volume24High": "$73.49M USD",
			"volume24Low": "$2.7",
			"high24Hour": "$2.92",
			"currentPrice": "$3.01"
		}
	]
}
